## 1- Imports

In [720]:
import pandas as pd
import numpy as np

## 2- DataFrame Titres et Entrées

In [721]:
df = pd.read_csv('allocine_films/data.csv')
df1 = pd.read_csv('allocine_films/films_data.csv')

In [722]:
df

                              Titre              Entrées
0         Avatar : la voie de l'eau  2 739 848,3 010 310
1              Le Processus de paix        34 918,15 048
2                The Lost City of Z       150 045,76 883
3       Spider-Man : New Generation      218 728,149 041
4                   Jeanne du Barry       45 029,356 152
...                             ...                  ...
8692                         Triomf               140,66
8693                       Property               106,20
8694  Nocturnes pour le roi de Rome              211,161
8695              Notes Laura Fiori                14,11
8696          Hollywood, California                   83

[8697 rows x 2 columns]

In [723]:
df[df['Titre'] == "Bienvenue chez les Ch'tis"]

                         Titre            Entrées
269  Bienvenue chez les Ch'tis  555 392,4 378 720

In [724]:
df['Entrées'].isna().count()

8697

In [725]:
df[df['Titre']=='Oppenheimer']

Empty DataFrame
Columns: [Titre, Entrées]
Index: []

In [726]:
df1[df1['Titre']=='Oppenheimer']

              Titre     Entrées
30      Oppenheimer  80 500 000
114412  Oppenheimer         NaN

In [727]:

df[df['Titre']=='Barbie']

Empty DataFrame
Columns: [Titre, Entrées]
Index: []

In [728]:

df1[df1['Titre']=='Barbie']

         Titre      Entrées
33      Barbie  155 000 000
114410  Barbie          NaN

In [729]:
df[df['Titre']=='The Covenant']

Empty DataFrame
Columns: [Titre, Entrées]
Index: []

In [730]:
df1[df1['Titre']=='The Covenant']

               Titre              Entrées
282     The Covenant  6 380 188,3 615 081
40237   The Covenant                  NaN
114627  The Covenant                  NaN

In [731]:
df[df['Titre']=='Joy Ride']

        Titre    Entrées
219  Joy Ride  9 258,772

In [732]:
df = df.dropna()

In [733]:
df

                              Titre              Entrées
0         Avatar : la voie de l'eau  2 739 848,3 010 310
1              Le Processus de paix        34 918,15 048
2                The Lost City of Z       150 045,76 883
3       Spider-Man : New Generation      218 728,149 041
4                   Jeanne du Barry       45 029,356 152
...                             ...                  ...
8692                         Triomf               140,66
8693                       Property               106,20
8694  Nocturnes pour le roi de Rome              211,161
8695              Notes Laura Fiori                14,11
8696          Hollywood, California                   83

[8697 rows x 2 columns]

In [734]:
df['Entrées'] = df['Entrées'].str.replace(' ', '')

In [735]:

df[['Entrées_1', 'Entrées_2']] = df['Entrées'].str.split(',', expand=True)

In [736]:
df['Entrées_1'] = pd.to_numeric(df['Entrées_1'], errors='coerce').astype('Int64')
df['Entrées_2'] = pd.to_numeric(df['Entrées_2'], errors='coerce').astype('Int64')

In [737]:
df

                              Titre          Entrées  Entrées_1  Entrées_2
0         Avatar : la voie de l'eau  2739848,3010310    2739848    3010310
1              Le Processus de paix      34918,15048      34918      15048
2                The Lost City of Z     150045,76883     150045      76883
3       Spider-Man : New Generation    218728,149041     218728     149041
4                   Jeanne du Barry     45029,356152      45029     356152
...                             ...              ...        ...        ...
8692                         Triomf           140,66        140         66
8693                       Property           106,20        106         20
8694  Nocturnes pour le roi de Rome          211,161        211        161
8695              Notes Laura Fiori            14,11         14         11
8696          Hollywood, California               83         83       <NA>

[8697 rows x 4 columns]

## 3- Choix entre Entrées_1 et Entrées_2

In [738]:
print(df[df['Entrées_1'] >= df['Entrées_2']])

                              Titre        Entrées  Entrées_1  Entrées_2
1              Le Processus de paix    34918,15048      34918      15048
2                The Lost City of Z   150045,76883     150045      76883
3       Spider-Man : New Generation  218728,149041     218728     149041
5                           Apaches    33659,10567      33659      10567
6                          Deux Moi  238161,171486     238161     171486
...                             ...            ...        ...        ...
8691          Du bruit dans la tête           64,7         64          7
8692                         Triomf         140,66        140         66
8693                       Property         106,20        106         20
8694  Nocturnes pour le roi de Rome        211,161        211        161
8695              Notes Laura Fiori          14,11         14         11

[7630 rows x 4 columns]

In [739]:
print(df[df['Entrées_1'] < df['Entrées_2']])

                          Titre          Entrées  Entrées_1  Entrées_2
0     Avatar : la voie de l'eau  2739848,3010310    2739848    3010310
4               Jeanne du Barry     45029,356152      45029     356152
9                   Alibi.com 2    81100,1017788      81100    1017788
46                       Avatar  2648596,2925087    2648596    2925087
48                    The Whale      65064,69274      65064      69274
...                         ...              ...        ...        ...
8635                      2/Duo        1513,1638       1513       1638
8636             Pari(s) d'exil          101,138        101        138
8654       Professeur Balthazar        1802,2708       1802       2708
8675     Julius et le Père Noël       4010,10637       4010      10637
8683  Le syndrome de Montmartre            41,44         41         44

[630 rows x 4 columns]

In [740]:
# Fonction personnalisée pour appliquer les conditions
def calc_entrées(row):
    if pd.notnull(row['Entrées_2']):
        if row['Entrées_2'] > 7 * row['Entrées_1']:
            return row['Entrées_2']
        else:
            return row['Entrées_1']
    return row['Entrées_1']

# Appliquer la fonction pour créer la nouvelle colonne 'Entrées_1ère_semaine'
df['Entrées_1ère_semaine'] = df.apply(calc_entrées, axis=1)

In [741]:
print(df[df['Entrées_1'] < df['Entrées_2']])

                          Titre          Entrées  Entrées_1  Entrées_2  \
0     Avatar : la voie de l'eau  2739848,3010310    2739848    3010310
4               Jeanne du Barry     45029,356152      45029     356152
9                   Alibi.com 2    81100,1017788      81100    1017788
46                       Avatar  2648596,2925087    2648596    2925087
48                    The Whale      65064,69274      65064      69274
...                         ...              ...        ...        ...
8635                      2/Duo        1513,1638       1513       1638
8636             Pari(s) d'exil          101,138        101        138
8654       Professeur Balthazar        1802,2708       1802       2708
8675     Julius et le Père Noël       4010,10637       4010      10637
8683  Le syndrome de Montmartre            41,44         41         44

      Entrées_1ère_semaine
0                  2739848
4                   356152
9                  1017788
46                 2648596
48                   65064
...                    ...
8635                  1513
8636                   101
8654                  1802
8675                  4010
8683                    41

[630 rows x 5 columns]

In [742]:
df

,Titre,Entrées,Entrées_1,Entrées_2,Entrées_1ère_semaine
0,Avatar : la voie de l'eau,"2739848,3010310",2739848,3010310,2739848
1,Le Processus de paix,"34918,15048",34918,15048,34918
2,The Lost City of Z,"150045,76883",150045,76883,150045
3,Spider-Man : New Generation,"218728,149041",218728,149041,218728
4,Jeanne du Barry,"45029,356152",45029,356152,356152
...,...,...,...,...,...
8692,Triomf,"140,66",140,66,140
8693,Property,"106,20",106,20,106
8694,Nocturnes pour le roi de Rome,"211,161",211,161,211
8695,Notes Laura Fiori,"14,11",14,11,14
8696,"Hollywood, California",83,83,<NA>,83

## 4- DataFrame Titre et Entrées 1ère semaine

In [743]:
df = df[['Titre', 'Entrées_1ère_semaine']]

In [744]:
df

                              Titre  Entrées_1ère_semaine
0         Avatar : la voie de l'eau               2739848
1              Le Processus de paix                 34918
2                The Lost City of Z                150045
3       Spider-Man : New Generation                218728
4                   Jeanne du Barry                356152
...                             ...                   ...
8692                         Triomf                   140
8693                       Property                   106
8694  Nocturnes pour le roi de Rome                   211
8695              Notes Laura Fiori                    14
8696          Hollywood, California                    83

[8697 rows x 2 columns]

In [745]:
df['Titre'].value_counts()

La Traversée                     3
Brothers                         3
Invasion                         3
Le Chemin                        3
Brooklyn                         2
                                ..
Cyprien                          1
Gangsterdam                      1
Les Vacances du Petit Nicolas    1
Parents d'élèves                 1
Hollywood, California            1
Name: Titre, Length: 8591, dtype: int64

In [746]:
df[df['Titre']== 'Brothers']

         Titre  Entrées_1ère_semaine
608   Brothers                151186
6525  Brothers                   833
8148  Brothers                    46

In [747]:
duplicate_rows = df[df.duplicated(subset='Titre', keep=False)]
duplicate_rows

                 Titre  Entrées_1ère_semaine
30                Coco                948846
58      Les Misérables                559378
80            Une nuit                 58679
172         Cendrillon                636418
174   En eaux troubles                710798
...                ...                   ...
8354         Invisible                   472
8362            Boogie                  4575
8411           L'Envol                  1633
8486             Noces                  1220
8569         L'Absence                   215

[208 rows x 2 columns]

In [748]:
df[df['Titre']=='Coco']

     Titre  Entrées_1ère_semaine
30    Coco                948846
3163  Coco               1806263

In [749]:
df[df['Titre']=="Cendrillon"]

           Titre  Entrées_1ère_semaine
172   Cendrillon                636418
2931  Cendrillon                 38457

In [750]:
# Enlever les titres dupliqués en gardant celui avec le plus grand nombre d'entrées
df.drop_duplicates(subset='Titre', keep='last', inplace=True)

# Réinitialiser les index du DataFrame après la suppression des doublons
df.reset_index(drop=True, inplace=True)

/tmp/ipykernel_14028/3731102788.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop_duplicates(subset='Titre', keep='last', inplace=True)

In [751]:
df

                              Titre  Entrées_1ère_semaine
0         Avatar : la voie de l'eau               2739848
1              Le Processus de paix                 34918
2                The Lost City of Z                150045
3       Spider-Man : New Generation                218728
4                   Jeanne du Barry                356152
...                             ...                   ...
8586                         Triomf                   140
8587                       Property                   106
8588  Nocturnes pour le roi de Rome                   211
8589              Notes Laura Fiori                    14
8590          Hollywood, California                    83

[8591 rows x 2 columns]

In [752]:
df[df['Titre'] == "Bienvenue chez les Ch'tis"]

                         Titre  Entrées_1ère_semaine
260  Bienvenue chez les Ch'tis               4378720

In [753]:
df.to_csv('allocine_titre_entrees_gold.csv', index=False)